{
  "manualTitle": "User Manual: Traffic Congestion CRUD - SP",
        "welcome": "Welcome to the traffic congestion data management system. This manual explains the application's main features.",
        "langLabel": "Language:",
        "syncTitle": "1. Data Synchronization",
        "syncDesc": "The <strong>`Synchronize 2018 Data`</strong> button connects to the SP City Hall's public API and starts downloading all congestion records (over 160,000).",
        "syncProgress": "<strong>Progress Bar:</strong> Next to the button, a progress bar will display the download status, which may take a few minutes.",
        "syncDb": "<strong>Database:</strong> The data is saved to a local database (<code>lentidao_2018.db</code>) so you can perform fast queries without needing an internet connection.",
        "filterTitle": "2. Search and Filtering",
        "filterDesc": "Once the data is synchronized, you can use the filter section to find specific records.",
        "filterDia": "<strong>Day:</strong> Allows you to select a specific date from the calendar.",
        "filterExpressa": "<strong>Expressway:</strong> Allows filtering by road type (A, E, Empty, or All).",
        "filterCorredor": "<strong>Corridor:</strong> Allows searching for a specific corridor name (e.g., 'Marginal Tietê').",
        "filterSentido": "<strong>Direction:</strong> Allows searching for a specific direction (e.g., 'Castelo/A.Senna').",
        "filterButton": "<strong>`Search` Button:</strong> After setting your filters, click 'Search' to display the results in the table.",
        "crudTitle": "3. Record Management (CRUD)",
        "crudDesc": "The system allows for complete manipulation (Create, Read, Update, Delete) of the records in your local database.",
        "crudAdd": "<strong>`Add New`:</strong> Opens a new window for you to manually insert a new congestion record into the database.",
        "crudDelete": "<strong>`Delete Selected`:</strong> To use, first <strong>click a row</strong> in the table to select it. Then, click this button to permanently remove the record from the database (a confirmation will be required).",
        "crudEdit": "<strong>`Edit Selected`:</strong> To use, first <strong>click a row</strong> in the table. Clicking this button will open a new window with that record's data, allowing you to make changes and save them.",
        "helpTitle": "4. Help",
        "helpDesc": "<strong>`Help / Manual` Button:</strong> Opens this user manual in a new window for quick reference."
    }