{
  "manualTitle": "Manual do Usuário: CRUD Lentidão de Trânsito - SP",
        "welcome": "Bem-vindo ao sistema de gerenciamento de dados de lentidão de trânsito. Este manual explica as principais funcionalidades da aplicação.",
        "langLabel": "Idioma:",
        "syncTitle": "1. Sincronização de Dados",
        "syncDesc": "O botão <strong>`Sincronizar Dados de 2018`</strong> conecta-se à API pública da Prefeitura de SP e inicia o download de todos os registros de lentidão (mais de 160.000).",
        "syncProgress": "<strong>Barra de Progresso:</strong> Ao lado do botão, uma barra de progresso mostrará o status do download, que pode levar alguns minutos.",
        "syncDb": "<strong>Banco de Dados:</strong> Os dados são salvos em um banco de dados local (<code>lentidao_2018.db</code>) para que você possa fazer consultas rápidas sem precisar de internet.",
        "filterTitle": "2. Busca e Filtragem",
        "filterDesc": "Depois que os dados estiverem sincronizados, você pode usar a seção de filtros para encontrar registros específicos.",
        "filterDia": "<strong>Dia:</strong> Permite selecionar uma data específica no calendário.",
        "filterExpressa": "<strong>Expressa:</strong> Permite filtrar por tipo de via (A, E, Vazio ou Todos).",
        "filterCorredor": "<strong>Corredor:</strong> Permite buscar por um nome de corredor específico (ex: 'Marginal Tietê').",
        "filterSentido": "<strong>Sentido:</strong> Permite buscar por um sentido específico (ex: 'Castelo/A.Senna').",
        "filterButton": "<strong>Botão `Buscar`:</strong> Após definir seus filtros, clique em 'Buscar' para exibir os resultados na tabela.",
        "crudTitle": "3. Gerenciamento de Registros (CRUD)",
        "crudDesc": "O sistema permite a manipulação completa (Criar, Ler, Atualizar, Excluir) dos registros que estão no seu banco de dados local.",
        "crudAdd": "<strong>`Adicionar Novo`:</strong> Abre uma nova janela para que você possa inserir manualmente um novo registro de lentidão no banco de dados.",
        "crudDelete": "<strong>`Excluir Selecionado`:</strong> Para usar, primeiro <strong>clique em uma linha</strong> na tabela para selecioná-la. Em seguida, clique neste botão para remover o registro permanentemente do banco de dados (uma confirmação será solicitada).",
        "crudEdit": "<strong>`Editar Selecionado`:</strong> Para usar, primeiro <strong>clique em uma linha</strong> na tabela. Ao clicar neste botão, uma nova janela será aberta com os dados daquele registro, permitindo que você faça alterações e as salve.",
        "helpTitle": "4. Ajuda",
        "helpDesc": "<strong>Botão `Ajuda / Manual`:</strong> Abre este manual do usuário em uma nova janela para referência rápida."
}