{
  "manualTitle": "Manual de Usuario: CRUD Congestión de Tráfico - SP",
        "welcome": "Bienvenido al sistema de gestión de datos de congestión de tráfico. Este manual explica las principales funcionalidades de la aplicación.",
        "langLabel": "Idioma:",
        "syncTitle": "1. Sincronización de Datos",
        "syncDesc": "El botón <strong>`Sincronizar Datos de 2018`</strong> se conecta a la API pública del Ayuntamiento de SP e inicia la descarga de todos los registros de congestión (más de 160,000).",
        "syncProgress": "<strong>Barra de Progreso:</strong> Al lado del botón, una barra de progreso mostrará el estado de la descarga, que puede tardar unos minutos.",
        "syncDb": "<strong>Base de Datos:</strong> Los datos se guardan en una base de datos local (<code>lentidao_2018.db</code>) para que pueda realizar consultas rápidas sin necesidad de internet.",
        "filterTitle": "2. Búsqueda y Filtrado",
        "filterDesc": "Una vez que los datos estén sincronizados, puede usar la sección de filtros para encontrar registros específicos.",
        "filterDia": "<strong>Día:</strong> Permite seleccionar una fecha específica en el calendario.",
        "filterExpressa": "<strong>Vía Rápida:</strong> Permite filtrar por tipo de vía (A, E, Vacío o Todos).",
        "filterCorredor": "<strong>Corredor:</strong> Permite buscar por un nombre de corredor específico (ej: 'Marginal Tietê').",
        "filterSentido": "<strong>Sentido:</strong> Permite buscar por un sentido específico (ej: 'Castelo/A.Senna').",
        "filterButton": "<strong>Botón `Buscar`:</strong> Después de definir sus filtros, haga clic en 'Buscar' para mostrar los resultados en la tabla.",
        "crudTitle": "3. Gestión de Registros (CRUD)",
        "crudDesc": "El sistema permite la manipulación completa (Crear, Leer, Actualizar, Eliminar) de los registros en su base de datos local.",
        "crudAdd": "<strong>`Añadir Nuevo`:</strong> Abre una nueva ventana para que pueda insertar manualmente un nuevo registro de congestión en la base de datos.",
        "crudDelete": "<strong>`Eliminar Selecionado`:</strong> Para usar, primero <strong>haga clic en una fila</strong> de la tabla para seleccionarla. Luego, haga clic en este botón para eliminar permanentemente el registro de la base de datos (se requerirá confirmación).",
        "crudEdit": "<strong>`Editar Selecionado`:</strong> Para usar, primero <strong>haga clic en una fila</strong> de la tabla. Al hacer clic en este botón, se abrirá una nueva ventana con los datos de ese registro, permitiéndole realizar cambios y guardarlos.",
        "helpTitle": "4. Ayuda",
        "helpDesc": "<strong>Botón `Ayuda / Manual`:</strong> Abre este manual de usuario en una nueva ventana para referencia rápida."
}